### Merge

Inner Join: Comman Data
Left join: Whole data from left side and comman data.
Right join:Whole data from right side and comman data from left side.
Outer Join: Whole data from both dtataframes

In [2]:
import pandas as pd
import numpy as np

In [9]:
df1={'City':['New York','Chicago','Orlando'],
    'Temprature':[21,14,35]}
df1

df1=pd.DataFrame(df1)
df1

       City  Temprature
0  New York          21
1   Chicago          14
2   Orlando          35

In [11]:
df2=pd.DataFrame({'City':['Chicago','New York','Orlando'],
                 'Humidity':[65,68,75]})
df2

       City  Humidity
0   Chicago        65
1  New York        68
2   Orlando        75

In [12]:
df3=pd.merge(df1,df2,on='City')

In [13]:
df3

       City  Temprature  Humidity
0  New York          21        68
1   Chicago          14        65
2   Orlando          35        75

In [16]:
df1={'City':['New York','Chicago','Orlando','Mumbai'],
    'Temprature':[21,14,35,37]}
df1

df1=pd.DataFrame(df1)
df1

       City  Temprature
0  New York          21
1   Chicago          14
2   Orlando          35
3    Mumbai          37

In [17]:
df2=pd.DataFrame({'City':['Chicago','New York','Pune'],
                 'Humidity':[65,68,77]})
df2

       City  Humidity
0   Chicago        65
1  New York        68
2      Pune        77

In [ ]:
# inner join

In [20]:
new_df=pd.merge(df1,df2,on='City',how='inner')

In [21]:
new_df

       City  Temprature  Humidity
0  New York          21        68
1   Chicago          14        65

In [ ]:
# outer join

In [22]:
new_df=pd.merge(df1,df2,on='City',how='outer')

In [23]:
new_df

       City  Temprature  Humidity
0  New York        21.0      68.0
1   Chicago        14.0      65.0
2   Orlando        35.0       NaN
3    Mumbai        37.0       NaN
4      Pune         NaN      77.0

In [ ]:
# left join

In [25]:
new_df=pd.merge(df1,df2,on='City',how='left')
new_df

       City  Temprature  Humidity
0  New York          21      68.0
1   Chicago          14      65.0
2   Orlando          35       NaN
3    Mumbai          37       NaN

In [26]:
# Right Join

In [27]:
new_df=pd.merge(df1,df2,on='City',how='right')
new_df

       City  Temprature  Humidity
0   Chicago        14.0        65
1  New York        21.0        68
2      Pune         NaN        77